//Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.
//Например, задан массив:
//1 4 7 2
//5 9 2 3
//8 4 2 4
//5 2 6 7
//Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка

Console.Clear();
Console.Write("Введите количество строк массива: ");
int rows = int.Parse(Console.ReadLine());
Console.Write("Введите количество столбцов массива: ");
int columns = int.Parse(Console.ReadLine());
int[,] Array = Random(rows,columns);

int[,] Random(int rows, int columns)
{
    int[,] result = new int[rows, columns];
    for (int i = 0; i < rows; i++)
    {
        for (int j = 0; j < columns; j++)
        {
            result[i, j] = new Random().Next(1,9);
        }

    }
    return result;
}
void PrintArray(int[,] array)
{
for (int i = 0; i < array.GetLength(0); i++)
    {
        Console.WriteLine();
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write($"{array[i, j]} ");
        }
}
Console.WriteLine();
}
Random(rows,columns);
Console.WriteLine("Исходный массив: ");
PrintArray(Array);

int SumLine(int[,] array, int i)
{
int sum = array[i,0];
for (int j = 1; j < array.GetLength(1); j++)
{
sum += array[i,j];
}
return sum;
}

int minSum = 1;
int sum = SumLine(Array, 0);
for (int i = 1; i < Array.GetLength(0); i++)
{
if (sum > SumLine(Array, i))
{
sum = SumLine(Array, i);
minSum = i+1;
}
}
Console.WriteLine($"\n Строка c наименьшей суммой элементов: {minSum}");